ROR projekt/untitled/app/controllers/adverts_controller.rb

  def create

    @advert = Advert.new(advert_params)
    adverts= Advert.all
    ids=adverts.to_a
    id=1
    ids.each do |row|
      id=row['id']
    end

    advertise_params={"user_id"=>session['user_id'],"advert_id"=>@advert.id,"mikor"=>DateTime.now}
    Advertise.create(advertise_params )
    #  sqlstring=session['user_id'].to_s+","+id.to_s+","+DateTime.now.to_s+','+Time.now.to_i.to_s+','+Time.now.to_i.to_s
    #ActiveRecord::Base.connection.exec_insert("BEGIN INSERT INTO advertises VALUES(#{sqlstring}); END;")

    respond_to do |format|
      if @advert.save
---
SELECT "ADVERTS".* FROM "ADVERTS"
INSERT INTO "ADVERTISES" ("USER_ID", "ADVERT_ID", "MIKOR", "CREATED_AT", "UPDATED_AT", "ID") VALUES (:a1, :a2, :a3, :a4, :a5, :a6)  [["user_id", 8], ["advert_id", 25], ["mikor", "2023-04-30"], ["created_at", "2023-04-30 09:31:16.304507"], ["updated_at", "2023-04-30 09:31:16.304507"], ["id", 26]]
INSERT INTO "ADVERTS" ("TERMEK_NEV", "MENNYISEG", "AR_KG", "MIN_VASARLAS", "LEIRAS", "CREATED_AT", "UPDATED_AT", "ID") VALUES (:a1, :a2, :a3, :a4, :a5, :a6, :a7, :a8)