ROR projekt/untitled/app/controllers/adverts_controller.rb

  def index
    @adverts = Advert.all
---
SELECT "ADVERTS".* FROM "ADVERTS"

  def osszes
    @adverts = Advert.all
---
SELECT "ADVERTS".* FROM "ADVERTS"

  def create
    @advert = Advert.new(advert_params)

    respond_to do |format|
      if @advert.save
---
INSERT INTO "ADVERTS" ("TERMEK_NEV", "MENNYISEG", "AR_KG", "MIN_VASARLAS", "CREATED_AT", "UPDATED_AT", "ID") VALUES (:a1, :a2, :a3, :a4, :a5, :a6, :a7)  [["termek_nev", "barmi"], ["mennyiseg", 12.0], ["ar_kg", 12.0], ["min_vasarlas", 12], ["created_at", "2023-04-11 17:03:57.636607"], ["updated_at", "2023-04-11 17:03:57.636607"], ["id", 26]]

  def update
    respond_to do |format|
      if @advert.update(advert_params)
---
UPDATE "ADVERTS" SET "TERMEK_NEV" = :a1, "UPDATED_AT" = :a2 WHERE "ADVERTS"."ID" = :a3  [["termek_nev", "Bolgar Lyukacsos Sziklaaa"], ["updated_at", "2023-04-15 13:26:08.774407"], ["id", 1]]

  def destroy
    @advert.destroy
---
DELETE FROM "ADVERTS" WHERE "ADVERTS"."ID" = :a1  [["id", 1]]

    def set_advert
      @advert = Advert.find(params[:id])
---
SELECT "ADVERTS".* FROM "ADVERTS" WHERE "ADVERTS"."ID" = :a1 FETCH FIRST :a2 ROWS ONLY  [["id", nil], ["LIMIT", 1]]