ROR projekt/untitled/app/controllers/advertises_controller.rb

SELECT "ADVERTISES".* FROM "ADVERTISES"
---
  def index
    @advertises = Advertise.all

DELETE FROM "ADVERTISES" WHERE "ADVERTISES"."ID" = :a1  [["id", 1]]
---
  def destroy
    @advertise.destroy

SELECT "ADVERTISES".* FROM "ADVERTISES" WHERE "ADVERTISES"."ID" = :a1 FETCH FIRST :a2 ROWS ONLY  [["id", 1], ["LIMIT", 1]]
---
    def set_advertise
      @advertise = Advertise.find(params[:id])