ROR projekt/untitled/app/controllers/carries_controller.rb

SELECT "CARRIES".* FROM "CARRIES"
---
  def index
    @carries = Carry.all