ROR projekt/untitled/app/controllers/delivers_controller.rb

SELECT "DELIVERS".* FROM "DELIVERS"
---
  def index
    @delivers = Deliver.all

DELETE FROM "DELIVERS" WHERE "DELIVERS"."ID" = :a1  [["id", 1]]
---
  def destroy
    @deliver.destroy

SELECT "DELIVERS".* FROM "DELIVERS" WHERE "DELIVERS"."ID" = :a1 FETCH FIRST :a2 ROWS ONLY  [["id", 1], ["LIMIT", 1]]
---
    def set_deliver
      @deliver = Deliver.find(params[:id])