ROR projekt/untitled/app/controllers/ertekels_controller.rb

  def index
    @ertekels = Ertekel.all
---
SELECT "ERTEKELS".* FROM "ERTEKELS"