ROR projekt/untitled/app/controllers/felhasznalos_controller.rb

SELECT "FELHASZNALOS".* FROM "FELHASZNALOS"
---
  def index
    @felhasznalos = Felhasznalo.all

INSERT INTO "FELHASZNALOS" ("NEV", "EMAIL", "JELSZO", "CREATED_AT", "UPDATED_AT", "ID") VALUES (:a1, :a2, :a3, :a4, :a5, :a6)  [["nev", "asd"], ["email", "asd"], ["jelszo", "asd"], ["created_at", "2023-03-29 20:35:43.867232"], ["updated_at", "2023-03-29 20:35:43.867232"], ["id", 1]]
---
  def create
    @felhasznalo = Felhasznalo.new(felhasznalo_params)

    respond_to do |format|
      if @felhasznalo.save

SELECT "FELHASZNALOS".* FROM "FELHASZNALOS" WHERE "FELHASZNALOS"."ID" = :a1 FETCH FIRST :a2 ROWS ONLY  [["id", 21], ["LIMIT", 1]]
---
    def set_felhasznalo
      @felhasznalo = Felhasznalo.find(params[:id])