ROR projekt/untitled/app/controllers/hirdetes_controller.rb

SELECT "HIRDETES".* FROM "HIRDETES"
---
  def index
    @hirdetes = Hirdete.all

SELECT "HIRDETES".* FROM "HIRDETES" WHERE "HIRDETES"."ID" = :a1 FETCH FIRST :a2 ROWS ONLY  [["id", 25], ["LIMIT", 1]]
---
    def set_hirdete
      @hirdete = Hirdete.find(params[:id])