ROR projekt/untitled/app/controllers/hirdets_controller.rb

  def index
    @hirdets = Hirdet.all
---
SELECT "HIRDETS".* FROM "HIRDETS"