ROR projekt/untitled/app/controllers/home_controller.rb

  def home
    @adverts = Advert.all
---
SELECT "ADVERTS".* FROM "ADVERTS"