ROR projekt/untitled/app/controllers/kiszallits_controller.rb

SELECT "KISZALLITS".* FROM "KISZALLITS"
---
  def index
    @kiszallits = Kiszallit.all