ROR projekt/untitled/app/controllers/mitszallits_controller.rb

  def index
    @mitszallits = Mitszallit.all
---
SELECT "MITSZALLITS".* FROM "MITSZALLITS"