ROR projekt/untitled/app/controllers/orders_controller.rb

DELETE FROM "ORDERS" WHERE "ORDERS"."ID" = :a1  [["id", 3]]
---
  def destroy
    @order.destroy

SELECT "ORDERS".* FROM "ORDERS" WHERE "ORDERS"."ID" = :a1 FETCH FIRST :a2 ROWS ONLY  [["id", 3], ["LIMIT", 1]]
---
    def set_order
      @order = Order.find(params[:id])