ROR projekt/untitled/app/controllers/rates_controller.rb

  def index
    @rates = Rate.all
---
SELECT "RATES".* FROM "RATES"

  def destroy
    @rate.destroy
---
DELETE FROM "RATES" WHERE "RATES"."ID" = :a1  [["id", 1]]

  def set_rate
    @rate = Rate.find(params[:id])
---
SELECT "RATES".* FROM "RATES" WHERE "RATES"."ID" = :a1 FETCH FIRST :a2 ROWS ONLY  [["id", 1], ["LIMIT", 1]]