ROR projekt/untitled/app/controllers/rendels_controller.rb

  def index
    @rendels = Rendel.all
---
SELECT "RENDELS".* FROM "RENDELS"

  def create
    @rendel = Rendel.new(rendel_params)

    respond_to do |format|
      if @rendel.save
---
INSERT INTO "RENDELS" ("FELHASZN_ID", "HIRDETES_ID", "SZALLITO_ID", "CREATED_AT", "UPDATED_AT", "ID") VALUES (:a1, :a2, :a3, :a4, :a5, :a6)  [["felhaszn_id", 1], ["hirdetes_id", 1], ["szallito_id", 1], ["created_at", "2023-03-30 10:34:58.665485"], ["updated_at", "2023-03-30 10:34:58.665485"], ["id", 1]]

  def destroy
    @rendel.destroy
---
DELETE FROM "RENDELS" WHERE "RENDELS"."ID" = :a1  [["id", 7]]

    def set_rendel
      @rendel = Rendel.find(params[:id])
---
SELECT "RENDELS".* FROM "RENDELS" WHERE "RENDELS"."ID" = :a1 FETCH FIRST :a2 ROWS ONLY  [["id", 7], ["LIMIT", 1]]