ROR projekt/untitled/app/controllers/sessions_controller.rb

  def create
    user = User.find_by(nev: params[:nev])
---
SELECT "USERS".* FROM "USERS" WHERE "USERS"."NEV" = :a1 FETCH FIRST :a2 ROWS ONLY  [["nev", "Peti"], ["LIMIT", 1]]