ROR projekt/untitled/app/controllers/szallitos_controller.rb

SELECT "SZALLITOS".* FROM "SZALLITOS"
---
  def index
    @szallitos = Szallito.all

INSERT INTO "SZALLITOS" ("KM_AR", "AR_KG", "CREATED_AT", "UPDATED_AT", "ID") VALUES (:a1, :a2, :a3, :a4, :a5)  [["km_ar", 24.0], ["ar_kg", 50.0], ["created_at", "2023-03-29 20:30:39.069168"], ["updated_at", "2023-03-29 20:30:39.069168"], ["id", 1]]
---
  def create
    @szallito = Szallito.new(szallito_params)

    respond_to do |format|
      if @szallito.save

UPDATE "SZALLITOS" SET "KM_AR" = :a1, "UPDATED_AT" = :a2 WHERE "SZALLITOS"."ID" = :a3  [["km_ar", 331.0], ["updated_at", "2023-03-29 20:33:01.946620"], ["id", 12]]
---
  def update
    respond_to do |format|
      if @szallito.update(szallito_params)

DELETE FROM "SZALLITOS" WHERE "SZALLITOS"."ID" = :a1  [["id", 21]]
---
  def destroy
    @szallito.destroy

SELECT "SZALLITOS".* FROM "SZALLITOS" WHERE "SZALLITOS"."ID" = :a1 FETCH FIRST :a2 ROWS ONLY  [["id", 12], ["LIMIT", 1]]
---
    def set_szallito
      @szallito = Szallito.find(params[:id])