ROR projekt/untitled/app/controllers/userdata_controller.rb

  def profile
    @user = User.find_by(id: session[:user_id])
---
SELECT "USERS".* FROM "USERS" WHERE "USERS"."ID" = :a1 FETCH FIRST :a2 ROWS ONLY  [["id", 19], ["LIMIT", 1]]