ROR projekt/untitled/app/controllers/users_controller.rb

INSERT INTO "USERS" ("NEV", "EMAIL", "PASSWORD_DIGEST", "CREATED_AT", "UPDATED_AT", "ADMIN", "ID") VALUES (:a1, :a2, :a3, :a4, :a5, :a6, :a7)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "USERS" SET "NEV" = :a1, "UPDATED_AT" = :a2 WHERE "USERS"."ID" = :a3  [["nev", "Peti"], ["updated_at", "2023-04-29 16:08:10.228756"], ["id", 19]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)

DELETE FROM "USERS" WHERE "USERS"."ID" = :a1  [["id", 22]]
---
  def destroy
    @user.destroy

SELECT "USERS".* FROM "USERS" WHERE "USERS"."ID" = :a1 FETCH FIRST :a2 ROWS ONLY  [["id", 1], ["LIMIT", 1]]
---
    def set_user
      @user = User.find(params[:id])